src/DataProcessors/ЗанятостьПомещений/ЗанятостьПомещений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗанятостьПомещений</name>
</mdclass:DataProcessor>

src/Enums/СтатусыДоговоровАренды/СтатусыДоговоровАренды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыДоговоровАренды</name>
  <enumValues>
    <name>Проект</name>
  </enumValues>
  <enumValues>
    <name>Действует</name>
  </enumValues>
  <enumValues>
    <name>Расторгнут</name>
  </enumValues>
  <enumValues>
    <name>Истек</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Помещения/Помещения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Помещения</name>
  <attributes>
    <name>Площадь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Этаж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПомещения</name>
    <type>
      <types>EnumRef.СтатусыПомещений</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаЗаКвМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/ДоговорыАрендаторов/ДоговорыАрендаторов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыАрендаторов</name>
  <owners>Catalog.Арендаторы</owners>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровАренды</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредметДоговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автопродление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаАрендыЗаМесяц</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбеспечительныйПлатеж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДеньОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДоговоровАренды</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Помещения</name>
    <attributes>
      <name>Помещение</name>
      <type>
        <types>CatalogRef.Помещения</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаЗаКвМ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Площадь</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ГрафикПлатежей</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/DataProcessors/ЗанятостьПомещений/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Дата = НачалоДня(ТекущаяДатаСеанса());
	СформироватьНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)
	
	СформироватьНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СправочникПомещений.Ссылка КАК Помещение,
		|	СправочникПомещений.Площадь КАК Площадь,
		|	СправочникПомещений.Этаж КАК Этаж,
		|	ВЫБОР
		|		КОГДА Договоры.Ссылка ЕСТЬ NULL
		|			ТОГДА ""Свободно""
		|		КОГДА Договоры.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
		|				ИЛИ Договоры.ДатаОкончания >= &Дата
		|			ТОГДА ""Занято""
		|		ИНАЧЕ ""Зарезервировано""
		|	КОНЕЦ КАК Состояние,
		|	Договоры.Ссылка КАК Договор,
		|	Договоры.Владелец КАК Арендатор,
		|	Договоры.ДатаНачала КАК ДатаНачала,
		|	Договоры.ДатаОкончания КАК ДатаОкончания,
		|	ВЫБОР
		|		КОГДА Договоры.Ссылка ЕСТЬ NULL
		|			ТОГДА 1
		|		КОГДА Договоры.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
		|				ИЛИ Договоры.ДатаОкончания >= &Дата
		|			ТОГДА 3
		|		ИНАЧЕ 2
		|	КОНЕЦ КАК Приоритет
		|ИЗ
		|	Справочник.Помещения КАК СправочникПомещений
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыАрендаторов.Помещения КАК СтрокиДоговоров
		|		ПО СправочникПомещений.Ссылка = СтрокиДоговоров.Помещение
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыАрендаторов КАК Договоры
		|		ПО СтрокиДоговоров.Ссылка = Договоры.Ссылка
		|			И Договоры.ДатаНачала <= &Дата
		|			И (Договоры.ДатаОкончания >= &Дата
		|				ИЛИ Договоры.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
		|				ИЛИ (Договоры.Автопродление = ИСТИНА
		|					И Договоры.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровАренды.Действует)))
		|УПОРЯДОЧИТЬ ПО
		|	СправочникПомещений.Ссылка";
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Данные = Запрос.Выполнить().Выгрузить();
	
	ЛучшийПриоритет = Новый Соответствие;
	Для Каждого СтрокаДанных Из Данные Цикл
		Текущий = ЛучшийПриоритет[СтрокаДанных.Помещение];
		Если Текущий = Неопределено ИЛИ СтрокаДанных.Приоритет > Текущий Тогда
			ЛучшийПриоритет.Вставить(СтрокаДанных.Помещение, СтрокаДанных.Приоритет);
		КонецЕсли;
	КонецЦикла;
	
	Результат.Очистить();
	Добавленные = Новый Соответствие;
	Для Каждого СтрокаДанных Из Данные Цикл
		Если Добавленные[СтрокаДанных.Помещение] = Истина
				ИЛИ СтрокаДанных.Приоритет <> ЛучшийПриоритет[СтрокаДанных.Помещение] Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = Результат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанных);
		Добавленные.Вставить(СтрокаДанных.Помещение, Истина);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
